app/Controllers/Laporan.php

	public function historiBayar(){

		$this->bayar->join('siswa','siswa.nisn=pembayaran.nisn');
		$this->bayar->join('kelas','kelas.id_kelas=siswa.id_kelas');
		$data['listPembayaran']=$this->bayar->where('siswa.nisn',$this->request->getPost('txtNoIndukSiswaNasional'))->orderBy('tgl_bayar','asc')->findAll();
---
SELECT *
FROM `pembayaran`
JOIN `siswa` ON `siswa`.`nisn`=`pembayaran`.`nisn`
JOIN `kelas` ON `kelas`.`id_kelas`=`siswa`.`id_kelas`
WHERE `siswa`.`nisn` = '001'
ORDER BY `tgl_bayar` ASC