app/Controllers/Siswa.php

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas`=`siswa`.`id_kelas`
JOIN `spp` ON `spp`.`id_spp`=`siswa`.`id_spp`
---
	public function index()
	{

		// 1. cek apakah yang login bukan admin
		if(session()->get('level')!='admin'){
			return redirect()->to('/petugas/dashboard');
			exit;
		}

		// 2. query builder data siswa

		$this->siswa->join('kelas','kelas.id_kelas=siswa.id_kelas');
		$this->siswa->join('spp','spp.id_spp=siswa.id_spp');

		// 2. jalankan query builder
		$data['listSiswa']=$this->siswa->findAll();

SELECT *
FROM `kelas`
SELECT *
FROM `siswa`
WHERE `nisn` = '006'
---
	public function editSiswa($nisn){
		// 1. cek apakah yang login bukan admin
		if(session()->get('level')!='admin'){
			return redirect()->to('/petugas/dashboard');
			exit;
		}

		// 2. ambil data kelas
		$data['listKelas']=$this->kelas->findAll();

		// 3. ambil data spp
		$data['listTarifSpp']=$this->spp->findAll();

		// 4. ambil data siswa
		$data['detailSiswa']=$this->siswa->where('nisn',$nisn)->find();

UPDATE `siswa` SET `nis` = '202110065069', `nama` = 'Riska ', `id_kelas` = '2', `alamat` = 'Sukamulya', `no_telp` = '088865776899', `id_spp` = '3'
WHERE `siswa`.`nisn` IN ('002')
---
	public function updateSiswa(){
		// 1. cek apakah yang login bukan admin
		if(session()->get('level')!='admin'){
			return redirect()->to('/petugas/dashboard');
			exit;
		}

		$dataSiswa=[
			'nis'=>$this->request->getPost('txtInputNis'),
			'nama'=>$this->request->getPost('txtInputNama'),
			'id_kelas'=>$this->request->getPost('txtPilihanKelas'),
			'alamat'=>$this->request->getPost('txtInputAlamat'),
			'no_telp'=>$this->request->getPost('txtInputHandphone'),
			'id_spp'=>$this->request->getPost('txtPilihanTarif')
		];

		$this->siswa->update($this->request->getPost('txtInputNisn'),$dataSiswa);